# Groupby no python.

In [1]:
import numpy as np
import pandas as pd

In [3]:
dados_excel_csv_etc = {
    'Função' : ['Engenheiro','Mestre de obra','Pedreiro','Engenheiro','Mestre de obra','Pedreiro'],
    'Nomes' : ['Francisco Assis','Luiz Carvalho','Gerlan Melo','Francisco Ribamar','João Ambrosio','Fracisco Chico'],
    'Salário' : [3000, 1800, 1450, 2800, 1700, 1400]
}

In [5]:
df = pd.DataFrame(dados_excel_csv_etc)
df

           Função              Nomes  Salário
0      Engenheiro    Francisco Assis     3000
1  Mestre de obra      Luiz Carvalho     1800
2        Pedreiro        Gerlan Melo     1450
3      Engenheiro  Francisco Ribamar     2800
4  Mestre de obra      João Ambrosio     1700
5        Pedreiro     Fracisco Chico     1400

In [12]:
funcao = df.groupby('Função')
funcao.mean()# Repare que aqui é a média dos salários.

                Salário
Função
Engenheiro       2900.0
Mestre de obra   1750.0
Pedreiro         1425.0

In [15]:
df[df['Salário'] > 2000]

       Função              Nomes  Salário
0  Engenheiro    Francisco Assis     3000
3  Engenheiro  Francisco Ribamar     2800

In [18]:
df['Salário'] > 2000

0     True
1    False
2    False
3     True
4    False
5    False
Name: Salário, dtype: bool

In [21]:
df.groupby('Função').max()

                            Nomes  Salário
Função
Engenheiro      Francisco Ribamar     3000
Mestre de obra      Luiz Carvalho     1800
Pedreiro              Gerlan Melo     1450

In [23]:
df.groupby('Função').median()

                Salário
Função
Engenheiro       2900.0
Mestre de obra   1750.0
Pedreiro         1425.0

In [25]:
df.groupby('Função').min()

                          Nomes  Salário
Função
Engenheiro      Francisco Assis     2800
Mestre de obra    João Ambrosio     1700
Pedreiro         Fracisco Chico     1400

In [34]:
df.groupby(['Função', 'Nomes']).sum()

                                  Salário
Função         Nomes
Engenheiro     Francisco Assis       3000
               Francisco Ribamar     2800
Mestre de obra João Ambrosio         1700
               Luiz Carvalho         1800
Pedreiro       Fracisco Chico        1400
               Gerlan Melo           1450

In [39]:
df.groupby(['Função', 'Salário']).max()

                                    Nomes
Função         Salário
Engenheiro     2800     Francisco Ribamar
               3000       Francisco Assis
Mestre de obra 1700         João Ambrosio
               1800         Luiz Carvalho
Pedreiro       1400        Fracisco Chico
               1450           Gerlan Melo